JaKaczocha/LPC55S69/encRtcClock/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITENCPINS_SW_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITENCPINS_SW_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITENCPINS_SW_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENCPINS_SW_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITENCPINS_SW_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO0_2 (number 81), U6[11]/P20[5]/FC3_SPI_MISO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENCPINS_SIB_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITENCPINS_SIB_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITENCPINS_SIB_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENCPINS_SIB_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITENCPINS_SIB_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_3 (number 83), U3[11]/P20[3]/FC3_SPI_MOSI
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENCPINS_SIA_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITENCPINS_SIA_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITENCPINS_SIA_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENCPINS_SIA_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITENCPINS_SIA_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENCPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
